yuhki50/esp32-camera/sensors/ov5640.c
    case PIXFORMAT_GRAYSCALE:
      regs = ov5640_sensor_fmt_grayscale;
      break;

    case PIXFORMAT_RGB565:
    case PIXFORMAT_RGB888:
      regs = ov5640_sensor_fmt_rgb565;
      break;

    case PIXFORMAT_JPEG:
      regs = ov5640_sensor_fmt_jpeg;
      break;

    case PIXFORMAT_RAW:
      regs = ov5640_sensor_fmt_raw;
      break;

    default:
      ESP_LOGE(TAG, "Unsupported pixformat: %u", pixformat);
      return -1;
  }

  ret = write_regs(sensor->slv_addr, regs);
  if (ret == 0) {
    sensor->pixformat = pixformat;
    ESP_LOGD(TAG, "Set pixformat to: %u", pixformat);
  }
  return ret;
}

// OV5640 compatible
static int set_image_options(sensor_t *sensor) {
  int ret = 0;
  uint8_t reg18 = 0;
  uint8_t x_bin = 0;
  uint8_t y_bin = 0;

  // enable compression
  if (sensor->pixformat == PIXFORMAT_JPEG) {
    reg18 |= 0x80;
  }

  // binning for small framsizes
  if (sensor->status.framesize <= FRAMESIZE_SVGA) {
    x_bin |= 0x40;
    y_bin |= 0x80;
  }

  // V-Flip
  if (sensor->status.vflip) {
    reg18 |= 0x80;
  }

  // H-Mirror
  if (sensor->status.hmirror) {
    reg18 |= 0x40;
  }

  if (write_reg(sensor->slv_addr, TIMING_TC_REG18, reg18)
      || write_reg(sensor->slv_addr, ANALOG_CONTROL_D, y_bin)
      || write_reg(sensor->slv_addr, ARRAY_CONTROL01, x_bin)) {
    ESP_LOGE(TAG, "Setting Image Options Failed");
    ret = -1;
  }

  ESP_LOGD(TAG, "Set Image Options: Compression: %u, Binning: %u, V-Flip: %u, H-Mirror: %u",
           sensor->pixformat == PIXFORMAT_JPEG, sensor->status.framesize <= FRAMESIZE_SVGA, sensor->status.vflip, sensor->status.hmirror);
  return ret;
}

static int set_framesize(sensor_t *sensor, framesize_t framesize)
{
  int ret = 0;
  framesize_t old_framesize = sensor->status.framesize;
  sensor->status.framesize = framesize;

  if (framesize >= FRAMESIZE_INVALID) {
    ESP_LOGE(TAG, "Invalid framesize: %u", framesize);
    return -1;
  }
  uint16_t w = resolution[framesize][0];
  uint16_t h = resolution[framesize][1];

   // if (framesize > FRAMESIZE_SVGA) {
   //   ret  = write_reg(sensor->slv_addr, 0x4520, 0xb0)
   //          || write_reg(sensor->slv_addr, X_INCREMENT, 0x11)//odd:1, even: 1
   //          || write_reg(sensor->slv_addr, Y_INCREMENT, 0x11);//odd:1, even: 1
   // } else {
   //   ret  = write_reg(sensor->slv_addr, 0x4520, 0x0b)
   //          || write_reg(sensor->slv_addr, X_INCREMENT, 0x31)//odd:3, even: 1
   //          || write_reg(sensor->slv_addr, Y_INCREMENT, 0x31);//odd:3, even: 1
   // }
  
   if (ret) {
     goto fail;
   }

  ret  = write_addr_reg(sensor->slv_addr, X_ADDR_ST_H, 432, 10)
         || write_addr_reg(sensor->slv_addr, X_ADDR_END_H, 2592, 1944) // 0x3804, 0x3805, 0x3806, 0x3807 to 2079 and 1547
         || write_addr_reg(sensor->slv_addr, X_OUTPUT_SIZE_H, w, h); // 0x3808, 0x3809, 0x380A, 0x380B to w and h

  if (ret) {
    goto fail;
  }

  if (framesize > FRAMESIZE_SVGA) {
    ret  = write_addr_reg(sensor->slv_addr, X_TOTAL_SIZE_H, 3200, 2000)
           || write_reg(sensor->slv_addr, XY_OFFSET, ((12 & 0x0F) << 4) | (2 & 0x0F));
  } else {
    if (framesize == FRAMESIZE_SVGA) {
      ret = write_addr_reg(sensor->slv_addr, X_TOTAL_SIZE_H, 3200, 1000);
    } else {
      ret = write_addr_reg(sensor->slv_addr, X_TOTAL_SIZE_H, 1600, 500);
    }
    if (ret == 0) {
      ret = write_reg(sensor->slv_addr, XY_OFFSET, ((12 & 0x0F) << 4) | (2 & 0x0F));
    }
  }

  if (ret == 0) {
    if (framesize == FRAMESIZE_QSXGA) {
      write_reg(sensor->slv_addr, ISP_CONTROL_01, 0x4f);
    } else {
      write_reg(sensor->slv_addr, ISP_CONTROL_01, 0x7f);
    }
  }

  // if (ret == 0) {
    // ret = set_image_options(sensor);
  // }

  // if (ret) {
  //   goto fail;
  // }

  // set_pll(sensor_t *sensor, bool bypass, uint8_t multiplier, uint8_t sys_div, uint8_t pre_div, bool root_2x, uint8_t seld5, bool pclk_manual, uint8_t pclk_div)
  if (sensor->pixformat == PIXFORMAT_JPEG) {
    if (framesize == FRAMESIZE_QSXGA) {
      // TODO !!! PLLの調整 をするところです
      //      write_reg(sensor->slv_addr, 0x3103, 0x03);
      ret = set_pll(sensor, false, 24, 1, 3, false, 0, true, 2);
      //      write_reg(sensor->slv_addr, 0x3011, 0x00);
      //      write_reg(sensor->slv_addr, 0x3012, 0x00);
      //      write_reg(sensor->slv_addr, 0x3010, 0x10);
      //      write_reg(sensor->slv_addr, 0x460C, 0x22);
    } else if (framesize == FRAMESIZE_QXGA) {
      //40MHz SYSCLK and 10MHz PCLK
      ret = set_pll(sensor, false, 24, 1, 3, false, 0, true, 8);
    } else {
      //50MHz SYSCLK and 10MHz PCLK
      ret = set_pll(sensor, false, 30, 1, 3, false, 0, true, 10);
    }
  } else {
    if (framesize > FRAMESIZE_CIF) {
      //10MHz SYSCLK and 10MHz PCLK (6.19 FPS)
      ret = set_pll(sensor, false, 2, 1, 0, false, 0, true, 2);
    } else {
      //25MHz SYSCLK and 10MHz PCLK (15.45 FPS)
      ret = set_pll(sensor, false, 5, 1, 0, false, 0, true, 5);
    }
  }

  if (ret == 0) {
    ESP_LOGD(TAG, "Set framesize to: %ux%u", w, h);
  }
  return ret;

fail:
  sensor->status.framesize = old_framesize;
  ESP_LOGE(TAG, "Setting framesize to: %ux%u failed", w, h);
  return ret;
}

static int set_hmirror(sensor_t *sensor, int enable)
{
  int ret = 0;
  sensor->status.hmirror = enable;
  ret = set_image_options(sensor);
  if (ret == 0) {
    ESP_LOGD(TAG, "Set h-mirror to: %d", enable);
  }
  return ret;
}

static int set_vflip(sensor_t *sensor, int enable)
{
  int ret = 0;
  sensor->status.vflip = enable;
  ret = set_image_options(sensor);
  if (ret == 0) {
    ESP_LOGD(TAG, "Set v-flip to: %d", enable);
  }
  return ret;
}

// OV5640 COMPATIBLE
static int set_quality(sensor_t *sensor, int qs)
{
  int ret = 0;
  ret = write_reg(sensor->slv_addr, COMPRESSION_CTRL07, qs & 0x3f);
  if (ret == 0) {
    sensor->status.quality = qs;
    ESP_LOGD(TAG, "Set quality to: %d", qs);
  }
  return ret;
}

static int set_colorbar(sensor_t *sensor, int enable)
{
  int ret = 0;
  ret = write_reg_bits(sensor->slv_addr, PRE_ISP_TEST_SETTING_1, TEST_COLOR_BAR, enable);
  if (ret == 0) {
    sensor->status.colorbar = enable;
    ESP_LOGD(TAG, "Set colorbar to: %d", enable);
  }
  return ret;
}

static int set_gain_ctrl(sensor_t *sensor, int enable)
{
  int ret = 0;
  ret = write_reg_bits(sensor->slv_addr, AEC_PK_MANUAL, AEC_PK_MANUAL_AGC_MANUALEN, !enable);
  if (ret == 0) {
    ESP_LOGD(TAG, "Set gain_ctrl to: %d", enable);
    sensor->status.agc = enable;
  }
  return ret;
}

