yuhki50/esp32-camera/sensors/ov5640.c
static int set_exposure_ctrl(sensor_t *sensor, int enable)
{
  int ret = 0;
  ret = write_reg_bits(sensor->slv_addr, AEC_PK_MANUAL, AEC_PK_MANUAL_AEC_MANUALEN, !enable);
  if (ret == 0) {
    ESP_LOGD(TAG, "Set exposure_ctrl to: %d", enable);
    sensor->status.aec = enable;
  }
  return ret;
}

static int set_whitebal(sensor_t *sensor, int enable)
{
  int ret = 0;
  ret = write_reg_bits(sensor->slv_addr, ISP_CONTROL_01, 0x01, enable);
  if (ret == 0) {
    ESP_LOGD(TAG, "Set awb to: %d", enable);
    sensor->status.awb = enable;
  }
  return ret;
}

//Advanced AWB
static int set_dcw_dsp(sensor_t *sensor, int enable)
{
  int ret = 0;
  ret = write_reg_bits(sensor->slv_addr, 0x5183, 0x80, !enable);
  if (ret == 0) {
    ESP_LOGD(TAG, "Set dcw to: %d", enable);
    sensor->status.dcw = enable;
  }
  return ret;
}

//night mode enable
static int set_aec2(sensor_t *sensor, int enable)
{
  int ret = 0;
  ret = write_reg_bits(sensor->slv_addr, 0x3a00, 0x04, enable);
  if (ret == 0) {
    ESP_LOGD(TAG, "Set aec2 to: %d", enable);
    sensor->status.aec2 = enable;
  }
  return ret;
}

static int set_bpc_dsp(sensor_t *sensor, int enable)
{
  int ret = 0;
  ret = write_reg_bits(sensor->slv_addr, 0x5000, 0x04, enable);
  if (ret == 0) {
    ESP_LOGD(TAG, "Set bpc to: %d", enable);
    sensor->status.bpc = enable;
  }
  return ret;
}

static int set_wpc_dsp(sensor_t *sensor, int enable)
{
  int ret = 0;
  ret = write_reg_bits(sensor->slv_addr, 0x5000, 0x02, enable);
  if (ret == 0) {
    ESP_LOGD(TAG, "Set wpc to: %d", enable);
    sensor->status.wpc = enable;
  }
  return ret;
}

//Gamma enable
static int set_raw_gma_dsp(sensor_t *sensor, int enable)
{
  int ret = 0;
  ret = write_reg_bits(sensor->slv_addr, 0x5000, 0x20, enable);
  if (ret == 0) {
    ESP_LOGD(TAG, "Set raw_gma to: %d", enable);
    sensor->status.raw_gma = enable;
  }
  return ret;
}

static int set_lenc_dsp(sensor_t *sensor, int enable)
{
  int ret = 0;
  ret = write_reg_bits(sensor->slv_addr, 0x5000, 0x80, enable);
  if (ret == 0) {
    ESP_LOGD(TAG, "Set lenc to: %d", enable);
    sensor->status.lenc = enable;
  }
  return ret;
}

static int get_agc_gain(sensor_t *sensor)
{
  int ra = read_reg(sensor->slv_addr, 0x350a);
  if (ra < 0) {
    return 0;
  }
  int rb = read_reg(sensor->slv_addr, 0x350b);
  if (rb < 0) {
    return 0;
  }
  int res = (rb & 0xF0) >> 4 | (ra & 0x03) << 4;
  if (rb & 0x0F) {
    res += 1;
  }
  return res;
}

//real gain
static int set_agc_gain(sensor_t *sensor, int gain)
{
  int ret = 0;
  if (gain < 0) {
    gain = 0;
  } else if (gain > 64) {
    gain = 64;
  }

  //gain value is 6.4 bits float
  //in order to use the max range, we deduct 1/16
  int gainv = gain << 4;
  if (gainv) {
    gainv -= 1;
  }

  ret = write_reg(sensor->slv_addr, 0x350a, gainv >> 8) || write_reg(sensor->slv_addr, 0x350b, gainv & 0xff);
  if (ret == 0) {
    ESP_LOGD(TAG, "Set agc_gain to: %d", gain);
    sensor->status.agc_gain = gain;
  }
  return ret;
}

static int get_aec_value(sensor_t *sensor)
{
  int ra = read_reg(sensor->slv_addr, 0x3500);
  if (ra < 0) {
    return 0;
  }
  int rb = read_reg(sensor->slv_addr, 0x3501);
  if (rb < 0) {
    return 0;
  }
  int rc = read_reg(sensor->slv_addr, 0x3502);
  if (rc < 0) {
    return 0;
  }
  int res = (ra & 0x0F) << 12 | (rb & 0xFF) << 4 | (rc & 0xF0) >> 4;
  return res;
}

static int set_aec_value(sensor_t *sensor, int value)
{
  int ret = 0, max_val = 0;
  max_val = read_reg16(sensor->slv_addr, 0x380e);
  if (max_val < 0) {
    ESP_LOGE(TAG, "Could not read max aec_value");
    return -1;
  }
  if (value > max_val) {
    value = max_val;
  }

  ret =  write_reg(sensor->slv_addr, 0x3500, (value >> 12) & 0x0F)
         || write_reg(sensor->slv_addr, 0x3501, (value >> 4) & 0xFF)
         || write_reg(sensor->slv_addr, 0x3502, (value << 4) & 0xF0);

  if (ret == 0) {
    ESP_LOGD(TAG, "Set aec_value to: %d / %d", value, max_val);
    sensor->status.aec_value = value;
  }
  return ret;
}

// OV5640 COMPATIBLE
static int set_ae_level(sensor_t *sensor, int level)
{
  int ret = 0;
  if (level < -5 || level > 5) {
    return -1;
  }
  //good targets are between 5 and 115
  int target_level = ((level + 5) * 10) + 5;

  int level_high, level_low;
  int fast_high, fast_low;

  level_low = target_level * 23 / 25; //0.92 (0.46)
  level_high = target_level * 27 / 25; //1.08 (2.08)

  fast_low = level_low >> 1;
  fast_high = level_high << 1;

  if (fast_high > 255) {
    fast_high = 255;
  }

  ret =  write_reg(sensor->slv_addr, 0x3a0f, level_high)
         || write_reg(sensor->slv_addr, 0x3a10, level_low)
         || write_reg(sensor->slv_addr, 0x3a1b, level_high)
         || write_reg(sensor->slv_addr, 0x3a1e, level_low)
         || write_reg(sensor->slv_addr, 0x3a11, fast_high)
         || write_reg(sensor->slv_addr, 0x3a1f, fast_low);

  if (ret == 0) {
    ESP_LOGD(TAG, "Set ae_level to: %d", level);
    sensor->status.ae_level = level;
  }
  return ret;
}

static int set_wb_mode(sensor_t *sensor, int mode)
{
  int ret = 0;
  if (mode < 0 || mode > 4) {
    return -1;
  }

  ret = write_reg(sensor->slv_addr, 0x3406, (mode != 0));
  if (ret) {
    return ret;
  }
  switch (mode) {
    case 1://Sunny
      ret  = write_reg16(sensor->slv_addr, 0x3400, 0x5e0) //AWB R GAIN
             || write_reg16(sensor->slv_addr, 0x3402, 0x410) //AWB G GAIN
             || write_reg16(sensor->slv_addr, 0x3404, 0x540);//AWB B GAIN
      break;
    case 2://Cloudy
      ret  = write_reg16(sensor->slv_addr, 0x3400, 0x650) //AWB R GAIN
             || write_reg16(sensor->slv_addr, 0x3402, 0x410) //AWB G GAIN
             || write_reg16(sensor->slv_addr, 0x3404, 0x4f0);//AWB B GAIN
      break;
    case 3://Office
      ret  = write_reg16(sensor->slv_addr, 0x3400, 0x520) //AWB R GAIN
             || write_reg16(sensor->slv_addr, 0x3402, 0x410) //AWB G GAIN
             || write_reg16(sensor->slv_addr, 0x3404, 0x660);//AWB B GAIN
      break;
    case 4://HOME
      ret  = write_reg16(sensor->slv_addr, 0x3400, 0x420) //AWB R GAIN
             || write_reg16(sensor->slv_addr, 0x3402, 0x3f0) //AWB G GAIN
             || write_reg16(sensor->slv_addr, 0x3404, 0x710);//AWB B GAIN
      break;
    default://AUTO
      break;
  }

  if (ret == 0) {
    ESP_LOGD(TAG, "Set wb_mode to: %d", mode);
    sensor->status.wb_mode = mode;
  }
  return ret;
}

