yuhki50/esp32-camera/sensors/ov5640.c
static int set_awb_gain_dsp(sensor_t *sensor, int enable)
{
  int ret = 0;
  int old_mode = sensor->status.wb_mode;
  int mode = enable ? old_mode : 0;

  ret = set_wb_mode(sensor, mode);

  if (ret == 0) {
    sensor->status.wb_mode = old_mode;
    ESP_LOGD(TAG, "Set awb_gain to: %d", enable);
    sensor->status.awb_gain = enable;
  }
  return ret;
}

static int set_special_effect(sensor_t *sensor, int effect)
{
  int ret = 0;
  if (effect < 0 || effect > 6) {
    return -1;
  }

  uint8_t * regs = (uint8_t *)ov5640_sensor_special_effects[effect];
  ret =  write_reg(sensor->slv_addr, 0x5580, regs[0])
         || write_reg(sensor->slv_addr, 0x5583, regs[1])
         || write_reg(sensor->slv_addr, 0x5584, regs[2])
         || write_reg(sensor->slv_addr, 0x5003, regs[3]);

  if (ret == 0) {
    ESP_LOGD(TAG, "Set special_effect to: %d", effect);
    sensor->status.special_effect = effect;
  }
  return ret;
}

static int set_brightness(sensor_t *sensor, int level)
{
  int ret = 0;
  uint8_t value = 0;
  bool negative = false;

  switch (level) {
    case 3:
      value = 0x30;
      break;
    case 2:
      value = 0x20;
      break;
    case 1:
      value = 0x10;
      break;
    case -1:
      value = 0x10;
      negative = true;
      break;
    case -2:
      value = 0x20;
      negative = true;
      break;
    case -3:
      value = 0x30;
      negative = true;
      break;
    default: // 0
      break;
  }

  ret = write_reg(sensor->slv_addr, 0x5587, value);
  if (ret == 0) {
    ret = write_reg_bits(sensor->slv_addr, 0x5588, 0x08, negative);
  }

  if (ret == 0) {
    ESP_LOGD(TAG, "Set brightness to: %d", level);
    sensor->status.brightness = level;
  }
  return ret;
}

static int set_contrast(sensor_t *sensor, int level)
{
  int ret = 0;
  if (level > 3 || level < -3) {
    return -1;
  }
  ret = write_reg(sensor->slv_addr, 0x5586, (level + 4) << 3);

  if (ret == 0) {
    ESP_LOGD(TAG, "Set contrast to: %d", level);
    sensor->status.contrast = level;
  }
  return ret;
}

static int set_saturation(sensor_t *sensor, int level)
{
  int ret = 0;
  if (level > 4 || level < -4) {
    return -1;
  }

  uint8_t * regs = (uint8_t *)ov5640_sensor_saturation_levels[level + 4];
  for (int i = 0; i < 11; i++) {
    ret = write_reg(sensor->slv_addr, 0x5381 + i, regs[i]);
    if (ret) {
      break;
    }
  }

  if (ret == 0) {
    ESP_LOGD(TAG, "Set saturation to: %d", level);
    sensor->status.saturation = level;
  }
  return ret;
}

static int set_sharpness(sensor_t *sensor, int level)
{
  int ret = 0;
  if (level > 3 || level < -3) {
    return -1;
  }

  uint8_t mt_offset_2 = (level + 3) * 8;
  uint8_t mt_offset_1 = mt_offset_2 + 1;

  ret = write_reg_bits(sensor->slv_addr, 0x5308, 0x40, false)//0x40 means auto
        || write_reg(sensor->slv_addr, 0x5300, 0x10)
        || write_reg(sensor->slv_addr, 0x5301, 0x10)
        || write_reg(sensor->slv_addr, 0x5302, mt_offset_1)
        || write_reg(sensor->slv_addr, 0x5303, mt_offset_2)
        || write_reg(sensor->slv_addr, 0x5309, 0x10)
        || write_reg(sensor->slv_addr, 0x530a, 0x10)
        || write_reg(sensor->slv_addr, 0x530b, 0x04)
        || write_reg(sensor->slv_addr, 0x530c, 0x06);

  if (ret == 0) {
    ESP_LOGD(TAG, "Set sharpness to: %d", level);
    sensor->status.sharpness = level;
  }
  return ret;
}

static int set_gainceiling(sensor_t *sensor, gainceiling_t level)
{
  int ret = 0, l = (int)level;

  ret = write_reg(sensor->slv_addr, 0x3A18, (l >> 8) & 3)
        || write_reg(sensor->slv_addr, 0x3A19, l & 0xFF);

  if (ret == 0) {
    ESP_LOGD(TAG, "Set gainceiling to: %d", l);
    sensor->status.gainceiling = l;
  }
  return ret;
}

static int get_denoise(sensor_t *sensor)
{
  if (!check_reg_mask(sensor->slv_addr, 0x5308, 0x10)) {
    return 0;
  }
  return (read_reg(sensor->slv_addr, 0x5306) / 4) + 1;
}

static int set_denoise(sensor_t *sensor, int level)
{
  int ret = 0;
  if (level < 0 || level > 8) {
    return -1;
  }

  ret = write_reg_bits(sensor->slv_addr, 0x5308, 0x10, level > 0);
  if (ret == 0 && level > 0) {
    ret = write_reg(sensor->slv_addr, 0x5306, (level - 1) * 4);
  }

  if (ret == 0) {
    ESP_LOGD(TAG, "Set denoise to: %d", level);
    sensor->status.denoise = level;
  }
  return ret;
}

static int init_status(sensor_t *sensor) {
  sensor->status.brightness = 0;
  sensor->status.contrast = 0;
  sensor->status.saturation = 0;
  sensor->status.sharpness = (read_reg(sensor->slv_addr, 0x5303) / 8) - 3;
  sensor->status.denoise = get_denoise(sensor);
  sensor->status.ae_level = 0;
  sensor->status.gainceiling = read_reg16(sensor->slv_addr, 0x3A18) & 0x3FF;
  sensor->status.awb = check_reg_mask(sensor->slv_addr, ISP_CONTROL_01, 0x01);
  sensor->status.dcw = !check_reg_mask(sensor->slv_addr, 0x5183, 0x80);
  sensor->status.agc = !check_reg_mask(sensor->slv_addr, AEC_PK_MANUAL, AEC_PK_MANUAL_AGC_MANUALEN);
  sensor->status.aec = !check_reg_mask(sensor->slv_addr, AEC_PK_MANUAL, AEC_PK_MANUAL_AEC_MANUALEN);
  sensor->status.hmirror = check_reg_mask(sensor->slv_addr, TIMING_TC_REG18, 0x40);
  sensor->status.vflip = check_reg_mask(sensor->slv_addr, TIMING_TC_REG18, 0x20);
  sensor->status.colorbar = check_reg_mask(sensor->slv_addr, PRE_ISP_TEST_SETTING_1, TEST_COLOR_BAR);
  sensor->status.bpc = check_reg_mask(sensor->slv_addr, 0x5000, 0x04);
  sensor->status.wpc = check_reg_mask(sensor->slv_addr, 0x5000, 0x02);
  sensor->status.raw_gma = check_reg_mask(sensor->slv_addr, 0x5000, 0x20);
  sensor->status.lenc = check_reg_mask(sensor->slv_addr, 0x5000, 0x80);
  sensor->status.quality = read_reg(sensor->slv_addr, COMPRESSION_CTRL07) & 0x3f;
  sensor->status.special_effect = 0;
  sensor->status.wb_mode = 0;
  sensor->status.awb_gain = check_reg_mask(sensor->slv_addr, 0x3406, 0x01);
  sensor->status.agc_gain = get_agc_gain(sensor);
  sensor->status.aec_value = get_aec_value(sensor);
  sensor->status.aec2 = check_reg_mask(sensor->slv_addr, 0x3a00, 0x04);
  return 0;
}

int ov5640_init(sensor_t *sensor)
{
  sensor->reset = reset;
  sensor->set_pixformat = set_pixformat;
  sensor->set_framesize = set_framesize;
  sensor->set_contrast = set_contrast;
  sensor->set_brightness = set_brightness;
  sensor->set_saturation = set_saturation;
  sensor->set_sharpness = set_sharpness;
  sensor->set_gainceiling = set_gainceiling;
  sensor->set_quality = set_quality;
  sensor->set_colorbar = set_colorbar;
  sensor->set_gain_ctrl = set_gain_ctrl;
  sensor->set_exposure_ctrl = set_exposure_ctrl;
  sensor->set_whitebal = set_whitebal;
  sensor->set_hmirror = set_hmirror;
  sensor->set_vflip = set_vflip;
  sensor->init_status = init_status;
  sensor->set_aec2 = set_aec2;
  sensor->set_aec_value = set_aec_value;
  sensor->set_special_effect = set_special_effect;
  sensor->set_wb_mode = set_wb_mode;
  sensor->set_ae_level = set_ae_level;
  sensor->set_dcw = set_dcw_dsp;
  sensor->set_bpc = set_bpc_dsp;
  sensor->set_wpc = set_wpc_dsp;
  sensor->set_awb_gain = set_awb_gain_dsp;
  sensor->set_agc_gain = set_agc_gain;
  sensor->set_raw_gma = set_raw_gma_dsp;
  sensor->set_lenc = set_lenc_dsp;
  sensor->set_denoise = set_denoise;
  return 0;
}
